{
  "table_info": {
    "table_columns": [
      "observed",
      "location_details",
      "county",
      "state",
      "season",
      "title",
      "latitude",
      "longitude",
      "date",
      "number",
      "classification",
      "geohash",
      "temperature_high",
      "temperature_mid",
      "temperature_low",
      "dew_point",
      "humidity",
      "cloud_cover",
      "moon_phase",
      "precip_intensity",
      "precip_probability",
      "precip_type",
      "pressure",
      "summary",
      "uv_index",
      "visibility",
      "wind_bearing",
      "wind_speed",
      "location"
    ],
    "table_samples": [
      {
        "observed": "Ed L. was salmon fishing with a companion in Prince William Sound. After anchoring off shore, his companion took a small boat up a river to check on the state of the salmon run. As the day wore on toward evening and he didn't come back at the expected time, Ed scanned upriver and across the adjacent land with binoculars. There he saw a sasquatch walking across the tundra, with long, smooth steps and with dark hair flowing from its shoulders, bouncing behind \"like a cape\" at every step. The sasquatch paid no attention to the boat (distance about 1,000').",
        "location_details": "East side of Prince William Sound",
        "county": "Valdez-Chitina-Whittier County",
        "state": "Alaska",
        "season": "Fall",
        "title": NaN,
        "latitude": NaN,
        "longitude": NaN,
        "date": NaN,
        "number": 1261.0,
        "classification": "Class A",
        "geohash": NaN,
        "temperature_high": NaN,
        "temperature_mid": NaN,
        "temperature_low": NaN,
        "dew_point": NaN,
        "humidity": NaN,
        "cloud_cover": NaN,
        "moon_phase": NaN,
        "precip_intensity": NaN,
        "precip_probability": NaN,
        "precip_type": NaN,
        "pressure": NaN,
        "summary": NaN,
        "uv_index": NaN,
        "visibility": NaN,
        "wind_bearing": NaN,
        "wind_speed": NaN,
        "location": NaN
      },
      {
        "observed": "There is a church where I attend services. We were practicing our Christmas play on the evening of November 12th 2001. It was about 8:45 p.m. when we finished practicing, when myself (age 17) and 3 other teenagers (15, 14, and 16) decided to go for a walk, while the adults stayed inside to talk. My cousin ran ahead and hid behind a pine thicket. These pines are in someones yard, they are probably about 12 or 13 ft. tall, and they are all in a row and real close together. Myself and the other two decided to turn back and head toward the church, not realizing that my cousin was not with us. We were to the end of the pines and starting up the church driveway, when she came running out from behind the trees screaming at the top of her lungs and stating that she had seen something. Just as I turned around, I saw a Very Tall and muscular looking figure walk out from the trees, and cross the road. It was about 7 to  7 1/2' Tall and slightly hunched over swinging it's arms well below it's thigh area, almost to the knees. It turned it's whole upper torso area and glanced at us while it was walking up the hillside. After we got into the car my cousin, still very petrified, stated that when she was behind the pine trees, something about 5 feet away from her pulled back a branch on one of the trees as if to get a better look at her. She stated that it's eyes were very far apart and sunk deep into it's face. She said the hand was 3 times the size of my uncles hand,(he is a large man, and he is her step father). She said that the hand was covered on top with coarse looking hair and it had black fingernails. She said she didn't smell or hear anything.  She said the reason was, that her face was so cold and her nose was plugged up and she couldn't have smelled nothing anyway. She said the creature was very tall about 7'-7 1/2' tall and very muscular. It's forehead was sloped and the top of its head looked like it had tufts of hair coming into a peak. Note; (This is exactly the way she described it to my family and hers.)",
        "location_details": "24 miles east of Parkersburg",
        "county": "Ritchie County",
        "state": "West Virginia",
        "season": "Fall",
        "title": "Report 3655: Daylight sighting near rural church on Rt. 31, east of Parkersburg, near Cairo",
        "latitude": 39.21833,
        "longitude": -81.16211,
        "date": "2001-11-12",
        "number": 3655.0,
        "classification": "Class A",
        "geohash": "dnyr157x3f",
        "temperature_high": 51.89,
        "temperature_mid": 38.93,
        "temperature_low": 25.97,
        "dew_point": 28.5,
        "humidity": 0.76,
        "cloud_cover": 0.0,
        "moon_phase": 0.91,
        "precip_intensity": NaN,
        "precip_probability": NaN,
        "precip_type": "rain",
        "pressure": 1033.72,
        "summary": "Clear throughout the day.",
        "uv_index": 3.0,
        "visibility": 9.5,
        "wind_bearing": 22.0,
        "wind_speed": 0.88,
        "location": "POINT(-81.16211 39.21833)"
      },
      {
        "observed": "I was gathering some firewood from a stack of previously split wood behind my house. I kept hearing a strange \"whooping\" sound coming from the thick woods about 100 yards away. My nearest neighbor has horses which I could hear bolting away about the same time. My dog ran to the edge of the woods and kept barking and running around back and forth in that area. I have never heard these kind of sounds before. It was after dark about 9:00 pm. I also could faintly smell a very odd smell. Strangly enough the smell reminded me of a zoo. The incident lasted about one or two minutes. I believe that I was being watched.",
        "location_details": "The area is near the small community of Salado. About 10 miles from Batesville and about 10 miles from Oil Trough going the other direction.",
        "county": "Independence County",
        "state": "Arkansas",
        "season": "Winter",
        "title": "Report 13286: Possible vocalizations near Salado.",
        "latitude": 35.69958,
        "longitude": -91.51528,
        "date": "2005-12-15",
        "number": 13286.0,
        "classification": "Class B",
        "geohash": "9yqgjdbt5k",
        "temperature_high": 51.17,
        "temperature_mid": 40.15,
        "temperature_low": 29.13,
        "dew_point": 24.0,
        "humidity": 0.5,
        "cloud_cover": 0.19,
        "moon_phase": 0.51,
        "precip_intensity": 0.0,
        "precip_probability": 0.0,
        "precip_type": NaN,
        "pressure": NaN,
        "summary": "Mostly cloudy starting in the evening.",
        "uv_index": 3.0,
        "visibility": 10.0,
        "wind_bearing": 279.0,
        "wind_speed": 5.29,
        "location": "POINT(-91.51528 35.69958)"
      },
      {
        "observed": "Myself and my two cousins were out hunting.  I had met up with my younger cousin and we both hiked up to an old logging road.  We then heard a very loud scream come from across a valley.  It was about a mile or so across and the scream seemed so loud at first I thought that some lady was screaming for help or something.  The screaming lasted for just a short time, mabey 30-45 seconds or so.  I Asked my cousins what that sound was and they said they have never heard it before even though they have hunted these woods for about seven years now.  I then remembered that I read in a book that sasquatch sometimes make a loud screaming noise.  I still do not know exactly what made that noise.",
        "location_details": "It was near the Diamond Peak Wilderness area maybe within five miles near it; we were about five or six thousand feet in elevation.",
        "county": "Lane County",
        "state": "Oregon",
        "season": "Fall",
        "title": "Report 1778: Three young hunters hear very loud scream across Diamond Peak Wilderness valley.",
        "latitude": 43.5883,
        "longitude": -122.0833,
        "date": "2000-09-10",
        "number": 1778.0,
        "classification": "Class B",
        "geohash": "9r9pvzj8kb",
        "temperature_high": NaN,
        "temperature_mid": NaN,
        "temperature_low": NaN,
        "dew_point": NaN,
        "humidity": NaN,
        "cloud_cover": NaN,
        "moon_phase": NaN,
        "precip_intensity": NaN,
        "precip_probability": NaN,
        "precip_type": NaN,
        "pressure": NaN,
        "summary": NaN,
        "uv_index": NaN,
        "visibility": NaN,
        "wind_bearing": NaN,
        "wind_speed": NaN,
        "location": "POINT(-122.0833 43.5883)"
      },
      {
        "observed": "I have talked to others who have heard or have seen what may be a Bigfoot. While talking to a fisherman he told me in 2000 that many people were hearing cries around the Scioto River. While along the river I have heard the same cries. It sounded like it was calling out another creature. The cries echoed up the river for about a 1/4 mile. The spring of that same year while walking around Lake White just north of a residential area I saw what I believe to be a Bigfoot. It seemed to be a younger one but just as tall. It appeared more manlike than ape-like. I could not believe my eyes so I bent down to get a better look as it moved rapidly behind a tree. As I looked it peeked from around the tree and looked at me. My mind said this is what they call a Bigfoot. As it moved so did the deer that were right behind me. I bolted and so did the deer. I think it was hunting the deer and the deer knew this. When I walked by the deer they stood still, then I saw the Bigfoot. The deer seemed confused on which direction to run away. This creature seemed to move very stealthlike like a kung fu like movement all in one motion. It seemed very smart and not afraid of me. It seems these animals travel the waterways as we do roads.",
        "location_details": "From Waverly take State Route 220 south and make a left onto State Route 551.",
        "county": "Pike County",
        "state": "Ohio",
        "season": "Spring",
        "title": "Report 5977: A brief encounter with a light colored hair covered creature",
        "latitude": 39.10611,
        "longitude": -83.0363,
        "date": "2000-05-01",
        "number": 5977.0,
        "classification": "Class A",
        "geohash": "dnuyqrnc9g",
        "temperature_high": NaN,
        "temperature_mid": NaN,
        "temperature_low": NaN,
        "dew_point": NaN,
        "humidity": NaN,
        "cloud_cover": NaN,
        "moon_phase": NaN,
        "precip_intensity": NaN,
        "precip_probability": NaN,
        "precip_type": NaN,
        "pressure": NaN,
        "summary": NaN,
        "uv_index": NaN,
        "visibility": NaN,
        "wind_bearing": NaN,
        "wind_speed": NaN,
        "location": "POINT(-83.0363 39.10611)"
      }
    ]
  },
  "nl_utterance": "Show me the count of sightings per moon phase for each state.",
  "refer_fileds": [
    {
      "field": "moon_phase",
      "type": "quantitative"
    },
    {
      "field": "state",
      "type": "nominal"
    }
  ],
  "refer_others": [
    {
      "c_type": "transform",
      "c_name": "aggregate",
      "c_list": [
        {
          "aggregate": "count"
        }
      ],
      "nl_ref_type": "explicit",
      "nl_ref_phrase": "..."
    }
  ],
  "generated_chart_list": [
    {
      "mark": "arc",
      "encoding": {
        "theta": {
          "field": "moon_phase",
          "type": "quantitative",
          "aggregate": "sum"
        },
        "color": {
          "field": "state",
          "type": "nominal"
        }
      }
    },
    {
      "mark": "arc",
      "encoding": {
        "theta": {
          "field": "moon_phase",
          "type": "quantitative",
          "aggregate": "mean"
        },
        "color": {
          "field": "state",
          "type": "nominal"
        }
      }
    },
    {
      "mark": "bar",
      "encoding": {
        "x": {
          "field": "state",
          "type": "nominal"
        },
        "y": {
          "field": "moon_phase",
          "type": "quantitative",
          "aggregate": "sum"
        }
      }
    },
    {
      "mark": "bar",
      "encoding": {
        "x": {
          "field": "state",
          "type": "nominal"
        },
        "y": {
          "field": "moon_phase",
          "type": "quantitative",
          "aggregate": "mean"
        }
      }
    },
    {
      "mark": "point",
      "encoding": {
        "x": {
          "field": "moon_phase",
          "type": "quantitative"
        },
        "y": {
          "field": "state",
          "type": "nominal"
        }
      }
    },
    {
      "mark": "point",
      "encoding": {
        "x": {
          "field": "state",
          "type": "nominal"
        },
        "y": {
          "field": "moon_phase",
          "type": "quantitative"
        }
      }
    },
    {
      "mark": "boxplot",
      "encoding": {
        "y": {
          "field": "moon_phase",
          "type": "quantitative"
        },
        "x": {
          "field": "state",
          "type": "nominal"
        }
      }
    }
  ]
}