{
  "table_info": {
    "table_columns": [
      "observed",
      "location_details",
      "county",
      "state",
      "season",
      "title",
      "latitude",
      "longitude",
      "date",
      "number",
      "classification",
      "geohash",
      "temperature_high",
      "temperature_mid",
      "temperature_low",
      "dew_point",
      "humidity",
      "cloud_cover",
      "moon_phase",
      "precip_intensity",
      "precip_probability",
      "precip_type",
      "pressure",
      "summary",
      "uv_index",
      "visibility",
      "wind_bearing",
      "wind_speed",
      "location"
    ],
    "table_samples": [
      {
        "observed": "Ed L. was salmon fishing with a companion in Prince William Sound. After anchoring off shore, his companion took a small boat up a river to check on the state of the salmon run. As the day wore on toward evening and he didn't come back at the expected time, Ed scanned upriver and across the adjacent land with binoculars. There he saw a sasquatch walking across the tundra, with long, smooth steps and with dark hair flowing from its shoulders, bouncing behind \"like a cape\" at every step. The sasquatch paid no attention to the boat (distance about 1,000').",
        "location_details": "East side of Prince William Sound",
        "county": "Valdez-Chitina-Whittier County",
        "state": "Alaska",
        "season": "Fall",
        "title": NaN,
        "latitude": NaN,
        "longitude": NaN,
        "date": NaN,
        "number": 1261.0,
        "classification": "Class A",
        "geohash": NaN,
        "temperature_high": NaN,
        "temperature_mid": NaN,
        "temperature_low": NaN,
        "dew_point": NaN,
        "humidity": NaN,
        "cloud_cover": NaN,
        "moon_phase": NaN,
        "precip_intensity": NaN,
        "precip_probability": NaN,
        "precip_type": NaN,
        "pressure": NaN,
        "summary": NaN,
        "uv_index": NaN,
        "visibility": NaN,
        "wind_bearing": NaN,
        "wind_speed": NaN,
        "location": NaN
      },
      {
        "observed": "I was with my friends at one of their houses. We were spending the night in a tent in his back yard and we had a small fire going. We had been hearing strange noises, like some animal grunting or snorting for about 15 minutes when we noticed a 10-12 foot tall hairy creature walking upright along a tree line at the edge of a corn field. We could see it since the corn was recently harvested down to the stalks. The creature appeared for about 20 seconds and then looked in our direction and took off into the woods. We could hear tree limbs falling and we could hear some more noises as it ran off. It was the scariest moment of my life, and I am not scared easily.",
        "location_details": "State Route 202 heading south to Ross road then to Wildcat Road.",
        "county": "Miami County",
        "state": "Ohio",
        "season": "Fall",
        "title": "Report 7718: Four teens camping hear grunting or snorting, observe creature walk from corn field into the woods",
        "latitude": 39.89172,
        "longitude": -84.14493,
        "date": "2003-09-03",
        "number": 7718.0,
        "classification": "Class A",
        "geohash": "dph4vnpd15",
        "temperature_high": 78.05,
        "temperature_mid": 70.85,
        "temperature_low": 63.65,
        "dew_point": 65.97,
        "humidity": 0.85,
        "cloud_cover": 0.72,
        "moon_phase": 0.25,
        "precip_intensity": 0.0002,
        "precip_probability": 1.0,
        "precip_type": "rain",
        "pressure": 1015.54,
        "summary": "Mostly cloudy until evening.",
        "uv_index": 5.0,
        "visibility": 5.8,
        "wind_bearing": 266.0,
        "wind_speed": 4.18,
        "location": "POINT(-84.14493 39.89172)"
      },
      {
        "observed": "My parents live at the base of Mount Timpanogos in Utah county.  Right in front of Timpanogos sits another mountain called Baldy.  We call it baldy because there are no pines or aspens on the front side of it. All the pines sit on the north side of the mountain, but everywhere else is very dense brush and very tall.  The only way to walk through it is on a game trail and even then you still get all scraped up. This incident happened in my backyard on a winter night around 10 - 10:30 in around 1998 when I was about 14 years old.  At this time there were not too many houses around and we have about 5 acres in the backyard up against the mountain.  Behind the five acres was nothing until you hit the city of Pleasant Grove.  Now, there are new houses all the way back.  In the winters there are always deer, elk, and cougars back there.  We've even had bighorn sheep come down that far too. My family and I were in the basement playing ping-pong.  We have a walk out basement sliding door that goes out into the back yard.  Right out the back door we have a small area of cement to play basketball and right off the side of that there is a ravine that slopes down off the back side for a 100 feet or so and its thick with acorn trees and other trees. Our neighbors fence between our property and theirs runs on the property line down to the bottom of the ravine….. anyway…. On this night I let my yellow lab out the back door cause he was scratching to go out and I thought he had to go to the bathroom or something.  As soon as I let him out he stopped and turned to his left and faced towards the neighbors fence and freaked out. He was a very protective dog but I have never seen him so protective in my entire life.  Its hard to describe because you would just have to be there. The moon was full and setting in the sky to the side where the neighbors fence is. I wondered what he was barking at because if it was a cat or another animal he would have gone after it, but he stayed in the same spot and even backed up a little bit.  So I knew it was most likely a human being by the way he was acting.  I turned on the back light and stepped out to look over at what ever he was barking at.  I didn’t see anything at first because the light made it hard to see, but then I noticed what it was he was barking at.  The moon was directly behind whatever it was and overhead so it created a silhouette and right on the fence line, which is only 20 to 30 ft. away, I could see the shape of half its head sitting above the top of the fence.  I just remember thinking… wow that’s a tall person wearing a beanie.  The shape of the head made me think that someone was wearing a beanie and it made the head shape a perfect oval. I had my little brother who is 2 years younger then me come stick his head out to see and he came over and said, “Oh, I see it.” I didn’t even think to try and talk to the person, even though they were chillin in our back yard. For some reason I knew it wouldn’t answer or something… It didn’t even cross my mind to talk and ask what they were doing back there. It lasted about a minute or two and then I saw the silhouette drop its head a little bit and turn towards the ravine and walk down into the trees.  When I saw it do that I tried to listen to its footsteps but heard absolutely nothing walking down into the trees. I have always believed it was a bigfoot. We are avid hunters and bow hunters, and spend tons of time in the mountains.  My father has a few different friends that have seen a  bigfoot or had experiences, but my Dad thinks its all a joke. I don’t though.  He even makes fun that I believe in something like that.  I don’t know what it was that my brother and I saw that winter evening but I know that Im 6’3” and that fence I'm talking about is as tall and even a little taller than I am.  I lived in that house for 20 years. My parents still live there, and there was nobody in their neighborhood or that area at that time who was that tall.",
        "location_details": "in the observed part",
        "county": "Utah County",
        "state": "Utah",
        "season": "Winter",
        "title": "Report 23291: Possible sighting at the base of Mount Timpanogos (west side of the mountain)",
        "latitude": 40.34937,
        "longitude": -111.6956,
        "date": "1998-01-31",
        "number": 23291.0,
        "classification": "Class B",
        "geohash": "9x0td33spg",
        "temperature_high": 37.43,
        "temperature_mid": 30.235,
        "temperature_low": 23.04,
        "dew_point": 28.34,
        "humidity": 0.84,
        "cloud_cover": 0.54,
        "moon_phase": 0.13,
        "precip_intensity": NaN,
        "precip_probability": NaN,
        "precip_type": "snow",
        "pressure": NaN,
        "summary": "Mostly cloudy until afternoon.",
        "uv_index": 3.0,
        "visibility": 10.0,
        "wind_bearing": 243.0,
        "wind_speed": 2.17,
        "location": "POINT(-111.6956 40.34937)"
      },
      {
        "observed": "A LONG STORY HERE. IT IS NOW MARCH 3, 2007.  I LIVE IN GUNTERSVILLE ALABAMA. I HAVE SPOKE TO SOME OF THE EMPLOYEES JUST AS CONVERSATION. THE STORY IS THIS.  ABOUT 15YRS AGO, MY WIFE, AND TWO CHILDREN WERE LEAVING OUR HOME IN HONEYCOMB, JUST NORTH OF GUNTERSVILLE OFF OF HWY. 431 AT THE BOTTOM OF GRANT ALABAMA. WE WERE IN ROUTE TO WAL-MART. ABOUT 8-9PM PROBABLY MID SUMMER. A WELL LIT SEEMS FULL MOON NIGHT. WE LIVED 4MI. AROUND PAST THE LAKE IN HONEYCOMB. I WAS DRIVING MY OLD HOT-ROD A 1964 FORD. THERE ARE SOME PERSONS BY THE LAST NAME OF (NAME REMOVED BY INVESTIGATOR) WHO ALWAYS HAVE DOGS IN THE STREET AT THEIR HOUSE BY THE LAKE. THE ROAD WHITE ELEPHANT RD. RUN BY THE WATERS EDGE IN FRONT OF THEIR HOME. THE ROAD IS ABOUT 4FT OFF OF THE SHORE LINE. THE (NAME REMOVED BY INVESTIGATOR) S HAD TWO ST. BERNARD DOGS ALONG WITH THEIR OTHER DOGS. THAT PARTICULAR NIGHT DRIVING PAST I SAW IN THE WATER WALKING AWAY FROM THE ROAD AND SHORE A LARGE 8'SASQUACHE. I LOOKED BACK IN MY REARVIEW MIRROR, AND STILL TURNED AROUND TO LOOK THRU MY BACK GLASS. MY WIFE SAW MY DISMAY, AND QUICKLY ASK WHAT’S WRONG, SHE AT THAT TIME LOOKED BACK, I ALWAYS DRIVE SLOW BY THEIR HOUSE AS THE DOGS ARE ALWAYS IN THE ROAD, SO SHE HAD TIME TO LOOK, ALL SHE SAW WAS THE RIPPLES IN THE WATER, AS WE PASSED A FEW TREES. IT WAS A FULL MOON NIGHT, AND NO WIND-CALM WATERS. NOW WHAT I SAW WAS THE 8' SASQUATCH CARRYING ONE OF THE ST. BERNARD HEADS. I IN THE TIME THAT DROVE BY SLOWLY SAW THE BIGFOOT FROM THE KNEES UP, CARRYING THE HEAD OF THE DOG, SOME FLESH WAS HANGING FROM THE NECK AREA. THE HEAD WAS IN THE BIGFOOT'S LEFT HAND. HE WAS CARRYING IT FROM THE DOG HAIR AT THE TOP OF THE DOG HEAD. I SAID TO MY WIFE AT THAT TIME THAT IF ONE OF THOSE DOGS CAME UP MISSING THAT THE SASQUATCH WAS THE REASON WHY. HOWEVER BOTH DOGS CAME UP MISSING AND WE NEVER SAW THEM AGAIN AFTER THAT TIME. NOW STORY UP TO DATE.  TELLING THE STORY TO MANY PERSONS IN THE YEARS PASSING, AS PEOPLE TELL STORIES, I FINALLY TOLD THE GUYS AT THE TVA WHERE I WORK AS A CONTRACTOR FOR THE GOVERNMENT. MY RELATIONSHIP WITH MR. (NAME REMOVED BY INVESTIGATOR) IS JUST KNOWING EACH OTHER FROM THE WINDOW OF OUR VEHICLE AS WE WOULD WAVE TO ONE ANOTHER, AS OUR CHILDREN ROAD THE SCHOOL BUSS WITH EACH OTHER. I FINALLY ONE DAY ABOUT 4YRS AGO ASKED HIM WHAT HAPPENED TO HIS DOGS, AND TOLD HIM THE STORY  OF WHAT I SAW. HE SAID ONE OF THE DOGS DIED IN HUNTSVILLE ALABAMA AT HIS MOTHERS HOME, AND THE OTHER DIED AT HIS HOME IN HONEYCOMB AND HE BURIED IT BEHIND HIS HOUSE. NOW. I DIDN'T PUSH THE ISSUE OF LETTING ME DIG UP THE DOG'S CORPS AS IT WOULD BE KIND OF TACKY. BUT IF YOU GUYS WANT TO CONTACT ME AND SEND SOME INVESTIGATORS TO CHECK AND SEE IF MR. (NAME REMOVED BY INVESTIGATOR) WOULD ALLOW YOU TO DIG UP THE CORPS TO SEE IF ITS HEAD IS MISSING, YOU MAY GET SOME CLUES OR EVEN SOME HAIR FORM THE SASQUATCH. HOWEVER IF THE HEAD IS STILL ATTACHED, THEN I WAS HALLUCINATING THE WHOLE THING, AND MY WIFE WOULD JUST IMAGINED THE WATER RIPPLES TOO. I DON’T DO DRUGS, OR SMOKE DOPE, AND DIDN'T AT THAT TIME EITHER.  THE ONLY THING RUNNING THRU MY VEINS IS GOOD WHOLESOME NATIVE AMERICAN BLOOD. I WOULD LOVE TO PARTICIPATE IN PURSUING THIS INVESTIGATION IF THERE WILL BE ONE.",
        "location_details": "FROM GUNTERSVILLE ALABAMA. TAKE 431-NORTH TO CATHREDRAL CAVERNS HWY. ( THIS ROAD GO TO GRANT ALABAMA.) TURN RIGHT OFF OF HWY. 431 ONTO CATHREDRAL CAVERNS HWY, GO ACROSS THE BRIDGE. TAKE THE FIRST LEFT, THAT IS WHITE ELEPHANT RD. JUST A MILE OR UP THAT ROAD IS WHERE THE SIGHTING WAS.",
        "county": "Marshall County",
        "state": "Alabama",
        "season": "Summer",
        "title": "Report 18043: Evening sighting by family driving by Guntersville Lake",
        "latitude": 34.276070000000004,
        "longitude": -86.17524,
        "date": "1992-08-15",
        "number": 18043.0,
        "classification": "Class A",
        "geohash": "dn4dzpc0e6",
        "temperature_high": 75.42,
        "temperature_mid": 65.885,
        "temperature_low": 56.35,
        "dew_point": 61.13,
        "humidity": 0.82,
        "cloud_cover": 0.04,
        "moon_phase": 0.57,
        "precip_intensity": NaN,
        "precip_probability": NaN,
        "precip_type": "rain",
        "pressure": NaN,
        "summary": "Partly cloudy until afternoon.",
        "uv_index": 10.0,
        "visibility": 8.66,
        "wind_bearing": 329.0,
        "wind_speed": 3.41,
        "location": "POINT(-86.17524 34.276070000000004)"
      },
      {
        "observed": "This happened about 25 years ago but I will remember it forever. I live in southeast Kansas. My husband and I were driving around looking for a fishing spot. We went down a dirt road to a strip pit (from strip mining coal). I was ahead of Michael and I was being very quiet. Michael was behind me and I could hear him walking through the weeds. I came to a small break in the brush with a game trail on it and I followed it . I walked about 20 feet and came out into a small clearing. I was looking straight ahead at the water and from behind and higher up in the air a screeching screaming sound started. It was so loud that I crouched down and covered my ears and I had my eyes closed. The scream would go for a few seconds and then it would pause and suck in some more air and scream again. This went on for several seconds. I finally could tell that the thing was running away and I stood up and opened my eyes. When I looked up the thing had jumped the creek in front of me about 10 feet and was running through the trees are was knocking the small trees aside as he ran away screaming the whole time. I know that I scared it when I stepped out into the clearing. I wasn't looking in that direction so I didn't see it standing there. It heard Michael behind me but I was being very quiet. When I stepped out into the clearing I scared it. Michael heard it screaming and started yelling for me.  That's when I stood up and looked and saw all the trees being knocked around as it ran past them.  It was the loudest animal I have ever heard. I might have saved my own life when I crouched down and covered my ears. The sound was a bit behind me and up in the air about 7 feet. It wasn't a bear or bird or anything else I could think of.  It was a sasquatch. Many people have seen them here. We have alot of wilderness and strip pits for them to hide and live in. I could have lost my life if it had wanted to hurt me, but I scared it so bad all it did was scream and run away.",
        "location_details": "1 mile from Big Brutus (a large coal excavator,a tourist spot).",
        "county": "Cherokee County",
        "state": "Kansas",
        "season": "Summer",
        "title": "Report 62405: Daylight encounter in a strip mine gully near \"Big Brutus\" (tourist attraction)",
        "latitude": 37.274,
        "longitude": -94.93115,
        "date": "1995-06-16",
        "number": 62405.0,
        "classification": "Class B",
        "geohash": "9yskpc90zc",
        "temperature_high": 86.28,
        "temperature_mid": 75.75,
        "temperature_low": 65.22,
        "dew_point": 65.6,
        "humidity": 0.72,
        "cloud_cover": 0.29,
        "moon_phase": 0.63,
        "precip_intensity": NaN,
        "precip_probability": NaN,
        "precip_type": "rain",
        "pressure": 1020.84,
        "summary": "Partly cloudy throughout the day.",
        "uv_index": 9.0,
        "visibility": 9.87,
        "wind_bearing": 158.0,
        "wind_speed": 9.41,
        "location": "POINT(-94.93115 37.274)"
      }
    ]
  },
  "nl_utterance": "Show the number of reports by moon phase for each location.",
  "refer_fileds": [
    {
      "field": "moon_phase",
      "type": "quantitative"
    },
    {
      "field": [
        "state",
        "county"
      ],
      "type": "nominal"
    }
  ],
  "refer_others": [
    {
      "c_type": "transform",
      "c_name": "aggregate",
      "c_list": [
        {
          "aggregate": "count"
        }
      ],
      "nl_ref_type": "explicit",
      "nl_ref_phrase": "..."
    }
  ],
  "generated_chart_list": [
    {
      "mark": "arc",
      "encoding": {
        "theta": {
          "field": "moon_phase",
          "type": "quantitative",
          "aggregate": "sum"
        },
        "color": {
          "field": "state",
          "type": "nominal"
        }
      }
    },
    {
      "mark": "arc",
      "encoding": {
        "theta": {
          "field": "moon_phase",
          "type": "quantitative",
          "aggregate": "mean"
        },
        "color": {
          "field": "state",
          "type": "nominal"
        }
      }
    },
    {
      "mark": "arc",
      "encoding": {
        "theta": {
          "field": "moon_phase",
          "type": "quantitative",
          "aggregate": "sum"
        },
        "color": {
          "field": "county",
          "type": "nominal"
        }
      }
    },
    {
      "mark": "arc",
      "encoding": {
        "theta": {
          "field": "moon_phase",
          "type": "quantitative",
          "aggregate": "mean"
        },
        "color": {
          "field": "county",
          "type": "nominal"
        }
      }
    },
    {
      "mark": "bar",
      "encoding": {
        "x": {
          "field": "state",
          "type": "nominal"
        },
        "y": {
          "field": "moon_phase",
          "type": "quantitative",
          "aggregate": "sum"
        }
      }
    },
    {
      "mark": "bar",
      "encoding": {
        "x": {
          "field": "state",
          "type": "nominal"
        },
        "y": {
          "field": "moon_phase",
          "type": "quantitative",
          "aggregate": "mean"
        }
      }
    },
    {
      "mark": "bar",
      "encoding": {
        "x": {
          "field": "county",
          "type": "nominal"
        },
        "y": {
          "field": "moon_phase",
          "type": "quantitative",
          "aggregate": "sum"
        }
      }
    },
    {
      "mark": "bar",
      "encoding": {
        "x": {
          "field": "county",
          "type": "nominal"
        },
        "y": {
          "field": "moon_phase",
          "type": "quantitative",
          "aggregate": "mean"
        }
      }
    },
    {
      "mark": "point",
      "encoding": {
        "x": {
          "field": "moon_phase",
          "type": "quantitative"
        },
        "y": {
          "field": "state",
          "type": "nominal"
        }
      }
    },
    {
      "mark": "point",
      "encoding": {
        "x": {
          "field": "moon_phase",
          "type": "quantitative"
        },
        "y": {
          "field": "county",
          "type": "nominal"
        }
      }
    },
    {
      "mark": "point",
      "encoding": {
        "x": {
          "field": "state",
          "type": "nominal"
        },
        "y": {
          "field": "moon_phase",
          "type": "quantitative"
        }
      }
    },
    {
      "mark": "point",
      "encoding": {
        "x": {
          "field": "county",
          "type": "nominal"
        },
        "y": {
          "field": "moon_phase",
          "type": "quantitative"
        }
      }
    },
    {
      "mark": "boxplot",
      "encoding": {
        "y": {
          "field": "moon_phase",
          "type": "quantitative"
        },
        "x": {
          "field": "state",
          "type": "nominal"
        }
      }
    },
    {
      "mark": "boxplot",
      "encoding": {
        "y": {
          "field": "moon_phase",
          "type": "quantitative"
        },
        "x": {
          "field": "county",
          "type": "nominal"
        }
      }
    }
  ]
}