{
  "table_info": {
    "table_columns": [
      "observed",
      "location_details",
      "county",
      "state",
      "season",
      "title",
      "latitude",
      "longitude",
      "date",
      "number",
      "classification",
      "geohash",
      "temperature_high",
      "temperature_mid",
      "temperature_low",
      "dew_point",
      "humidity",
      "cloud_cover",
      "moon_phase",
      "precip_intensity",
      "precip_probability",
      "precip_type",
      "pressure",
      "summary",
      "uv_index",
      "visibility",
      "wind_bearing",
      "wind_speed",
      "location"
    ],
    "table_samples": [
      {
        "observed": "Ed L. was salmon fishing with a companion in Prince William Sound. After anchoring off shore, his companion took a small boat up a river to check on the state of the salmon run. As the day wore on toward evening and he didn't come back at the expected time, Ed scanned upriver and across the adjacent land with binoculars. There he saw a sasquatch walking across the tundra, with long, smooth steps and with dark hair flowing from its shoulders, bouncing behind \"like a cape\" at every step. The sasquatch paid no attention to the boat (distance about 1,000').",
        "location_details": "East side of Prince William Sound",
        "county": "Valdez-Chitina-Whittier County",
        "state": "Alaska",
        "season": "Fall",
        "title": NaN,
        "latitude": NaN,
        "longitude": NaN,
        "date": NaN,
        "number": 1261.0,
        "classification": "Class A",
        "geohash": NaN,
        "temperature_high": NaN,
        "temperature_mid": NaN,
        "temperature_low": NaN,
        "dew_point": NaN,
        "humidity": NaN,
        "cloud_cover": NaN,
        "moon_phase": NaN,
        "precip_intensity": NaN,
        "precip_probability": NaN,
        "precip_type": NaN,
        "pressure": NaN,
        "summary": NaN,
        "uv_index": NaN,
        "visibility": NaN,
        "wind_bearing": NaN,
        "wind_speed": NaN,
        "location": NaN
      },
      {
        "observed": "Over the past several months I have heard knocks in the woods behind my house. I live in the Berkshires in MA on a wooded 6 acre lot that borders a very mountainous area with over 100 undeveloped acres. In addition, I have had some rocks being thrown at night while I have been on my back porch. My most recent occurrence was a few week ago while standing on my back porch I heard some noises nearby in the woods.I scanned the area with my high intensity flashlight and saw some eye shine about 40 yards into the woods. I stared at it for a while and then the animal turned and moved deeper into the woods. I subsequently estimated that the eyes would have been on something at least 7-8 feet tall.   In addition, my wife and I have heard knocks in the past and they even responded to my knocks on one occasion last fall.",
        "location_details": NaN,
        "county": "Berkshire County",
        "state": "Massachusetts",
        "season": "Winter",
        "title": NaN,
        "latitude": NaN,
        "longitude": NaN,
        "date": NaN,
        "number": 32670.0,
        "classification": "Class B",
        "geohash": NaN,
        "temperature_high": NaN,
        "temperature_mid": NaN,
        "temperature_low": NaN,
        "dew_point": NaN,
        "humidity": NaN,
        "cloud_cover": NaN,
        "moon_phase": NaN,
        "precip_intensity": NaN,
        "precip_probability": NaN,
        "precip_type": NaN,
        "pressure": NaN,
        "summary": NaN,
        "uv_index": NaN,
        "visibility": NaN,
        "wind_bearing": NaN,
        "wind_speed": NaN,
        "location": NaN
      },
      {
        "observed": "This is a second hand report.  Our daughter and her friend, a neighbor, were about ten years old and it was approximately 1988.  The two were walking into the woods off a trail near our home and saw a huge beige gorilla like creature.  The minute they saw it they were so scared they ran home.  Our daughter said there was no way this was a costumed person or another animal.  It was a tall two legged creature covered with beige colored hair. The two girls reported this incident to me almost immediately after it happened.  There was snow on the ground and they were wearing boots. I wanted them to show me the clearing where the creature was standing so I could look for footprints.  They said they would not go back there, they were too frightened.  On the way to tell me they saw another neighbor in her yard and told her but she did not believe them.  In the years since their sighting I have not thought much about it.  However, after reading websites on Bigfoot I really feel we have had Bigfoot living in the woods here.  It is not a really large area, but hard to get around in due to the marshy conditions around the small lake.",
        "location_details": "north on Lexington Ave. from Highway 96.  cross 85th Ave. continue past Flowerfield Rd.  You will barely see Hidden Lake on your right.  Take a right on Woodland Rd. (just past the church).  Take a right on 92nd Circle.  Take the long driveway straight ahead, or walk in there.  On your left you will see a trail (actually more than one but they all seem to come together).  Looking south toward Hidden Lake you will see the shelters.  This is the general area where the Bigfoot was seen.",
        "county": "Anoka County",
        "state": "Minnesota",
        "season": "Winter",
        "title": NaN,
        "latitude": NaN,
        "longitude": NaN,
        "date": NaN,
        "number": 7300.0,
        "classification": "Class A",
        "geohash": NaN,
        "temperature_high": NaN,
        "temperature_mid": NaN,
        "temperature_low": NaN,
        "dew_point": NaN,
        "humidity": NaN,
        "cloud_cover": NaN,
        "moon_phase": NaN,
        "precip_intensity": NaN,
        "precip_probability": NaN,
        "precip_type": NaN,
        "pressure": NaN,
        "summary": NaN,
        "uv_index": NaN,
        "visibility": NaN,
        "wind_bearing": NaN,
        "wind_speed": NaN,
        "location": NaN
      },
      {
        "observed": "My friend and I were driving back home, and we decided to go down the back roads instead of taking the main highway. So we took Rawsonville Road, to Newburg and headed eastbound. We were talking about the upcoming NFL Season, and what teams looked like the most likely candidates to go to the Super Bowl. Also, how bad the Lions are in comparison to other teams. As we were driving we noticed a dark object over by the right side road. As we drove closer we could see that it as covered with reddish dark hair. I turned to my friend and we both \"Oh wow a bear\". So we got about 15-20 yards from it and I honked the horn, and it stood up and turned completely around and looked at us, and then turned and walked northbound into the woods, on 2 legs like a human. We both stopped, and were in shock, and we said \"oh my God what was it\"! We had both windows part way down on my pickup truck, and we could smell an awful odor, like rotten eggs. Then about 30 seconds later my friend and I both said \"Bigfoot\" at about the same time. The creature was about 7-8 feet tall, and was very well built. It never made a sound at all, and after about 2 minutes we quickly drove off and headed down to Timbers Road and headed on home to Monroe.",
        "location_details": "This occurred on Newburg Road east of Rawsonville Road in Monroe County, Michigan.",
        "county": "Monroe County",
        "state": "Michigan",
        "season": "Summer",
        "title": NaN,
        "latitude": NaN,
        "longitude": NaN,
        "date": NaN,
        "number": 812.0,
        "classification": "Class A",
        "geohash": NaN,
        "temperature_high": NaN,
        "temperature_mid": NaN,
        "temperature_low": NaN,
        "dew_point": NaN,
        "humidity": NaN,
        "cloud_cover": NaN,
        "moon_phase": NaN,
        "precip_intensity": NaN,
        "precip_probability": NaN,
        "precip_type": NaN,
        "pressure": NaN,
        "summary": NaN,
        "uv_index": NaN,
        "visibility": NaN,
        "wind_bearing": NaN,
        "wind_speed": NaN,
        "location": NaN
      },
      {
        "observed": "My husband and I and three children decided to go camping for the 4th of July weekend at the Shawnee National Forrest Park in Ohio. We left on friday July 2,2010 and came home on July 6th. On July 6th at 4:00 a.m. in the morning my husband was awakened by a very strange noise and thought maybe raccoons were in our trash but then listened and thought that it couldnt be raccoons by the noise it was making. It sounded like it was calling the other one from the woods into the site. We heard the other one walking behind our tent and my husband started to yell \"HEY HEY GET OUT OF HERE\" and then they ran into the woods and it sounded like stomping.....we then knew it was something very very large. I got the kids and we ran to the car. We drove into Portsmouth for about an hour and half...we couldnt think of any animal that could make that noise or stomp like that through the woods. Maybe a bear but bears couldnt make that noise. So we went back to the campsite this was about 5:30 a.m. and my husband went up first to check it out....it was a liltle light out but not light enough to see into the woods... after he was up there for a little bit i went up and we herd something breathing heavy and then a stick was thrown at me and it made that noise again and we both ran to the car and just slept in our car. Finally when it was like 8:30a.m. we went up to the site and looked around and couldnt find anything missing and our garbage was ripped open but not spread out all over the place.....and my husband went up into the woods and found a pack of our raymon noodles that was opened but not eaten( i thought that was weird most animals eat anything).. So we packed everything up and left. Later that day when i was home i was thinking about the night before all this happened that when i was sitting by our fire i could hear something throwing stuff at our campsite and felt like something was watching us but i thought i was just scaring myself...but it all makes sense now they were watching us and finally came into our camping area the last day we were there! We were camping at 2 different sites that week the first site was xxx and the site that everything happened at was right next to that one just farther back in the woods and that one was xxx..... It was deffinately a night to remember and i have never had any kind of experience like this before in my life! I am scared and curious at the same time.....if only we would have had a flashlight we would have been able to see it but we only had a lantern!",
        "location_details": "campsite xxx at the campgrounds of Shawnee National Forrest Park",
        "county": "Scioto County",
        "state": "Ohio",
        "season": "Summer",
        "title": "Report 27972: Family camping at Shawnee State Forest has possible encounter",
        "latitude": 38.69322,
        "longitude": -83.12891,
        "date": "2010-07-06",
        "number": 27972.0,
        "classification": "Class B",
        "geohash": "dnuuh7gkk4",
        "temperature_high": 94.48,
        "temperature_mid": 82.83000000000001,
        "temperature_low": 71.18,
        "dew_point": 68.39,
        "humidity": 0.69,
        "cloud_cover": NaN,
        "moon_phase": 0.82,
        "precip_intensity": 0.0,
        "precip_probability": 0.0,
        "precip_type": NaN,
        "pressure": NaN,
        "summary": "Foggy throughout the day.",
        "uv_index": 0.0,
        "visibility": 1.06,
        "wind_bearing": 242.0,
        "wind_speed": 0.09,
        "location": "POINT(-83.12891 38.693220000000004)"
      }
    ]
  },
  "nl_utterance": "Create a bar chart showing the moon phase for each state.",
  "refer_fileds": [
    {
      "field": "moon_phase",
      "type": "quantitative"
    },
    {
      "field": "state",
      "type": "nominal"
    }
  ],
  "refer_others": [],
  "generated_chart_list": [
    {
      "mark": "arc",
      "encoding": {
        "theta": {
          "field": "moon_phase",
          "type": "quantitative",
          "aggregate": "sum"
        },
        "color": {
          "field": "state",
          "type": "nominal"
        }
      }
    },
    {
      "mark": "arc",
      "encoding": {
        "theta": {
          "field": "moon_phase",
          "type": "quantitative",
          "aggregate": "mean"
        },
        "color": {
          "field": "state",
          "type": "nominal"
        }
      }
    },
    {
      "mark": "bar",
      "encoding": {
        "x": {
          "field": "state",
          "type": "nominal"
        },
        "y": {
          "field": "moon_phase",
          "type": "quantitative",
          "aggregate": "sum"
        }
      }
    },
    {
      "mark": "bar",
      "encoding": {
        "x": {
          "field": "state",
          "type": "nominal"
        },
        "y": {
          "field": "moon_phase",
          "type": "quantitative",
          "aggregate": "mean"
        }
      }
    },
    {
      "mark": "point",
      "encoding": {
        "x": {
          "field": "moon_phase",
          "type": "quantitative"
        },
        "y": {
          "field": "state",
          "type": "nominal"
        }
      }
    },
    {
      "mark": "point",
      "encoding": {
        "x": {
          "field": "state",
          "type": "nominal"
        },
        "y": {
          "field": "moon_phase",
          "type": "quantitative"
        }
      }
    },
    {
      "mark": "boxplot",
      "encoding": {
        "y": {
          "field": "moon_phase",
          "type": "quantitative"
        },
        "x": {
          "field": "state",
          "type": "nominal"
        }
      }
    }
  ]
}