{
  "table_info": {
    "table_columns": [
      "observed",
      "location_details",
      "county",
      "state",
      "season",
      "title",
      "latitude",
      "longitude",
      "date",
      "number",
      "classification",
      "geohash",
      "temperature_high",
      "temperature_mid",
      "temperature_low",
      "dew_point",
      "humidity",
      "cloud_cover",
      "moon_phase",
      "precip_intensity",
      "precip_probability",
      "precip_type",
      "pressure",
      "summary",
      "uv_index",
      "visibility",
      "wind_bearing",
      "wind_speed",
      "location"
    ],
    "table_samples": [
      {
        "observed": "Ed L. was salmon fishing with a companion in Prince William Sound. After anchoring off shore, his companion took a small boat up a river to check on the state of the salmon run. As the day wore on toward evening and he didn't come back at the expected time, Ed scanned upriver and across the adjacent land with binoculars. There he saw a sasquatch walking across the tundra, with long, smooth steps and with dark hair flowing from its shoulders, bouncing behind \"like a cape\" at every step. The sasquatch paid no attention to the boat (distance about 1,000').",
        "location_details": "East side of Prince William Sound",
        "county": "Valdez-Chitina-Whittier County",
        "state": "Alaska",
        "season": "Fall",
        "title": NaN,
        "latitude": NaN,
        "longitude": NaN,
        "date": NaN,
        "number": 1261.0,
        "classification": "Class A",
        "geohash": NaN,
        "temperature_high": NaN,
        "temperature_mid": NaN,
        "temperature_low": NaN,
        "dew_point": NaN,
        "humidity": NaN,
        "cloud_cover": NaN,
        "moon_phase": NaN,
        "precip_intensity": NaN,
        "precip_probability": NaN,
        "precip_type": NaN,
        "pressure": NaN,
        "summary": NaN,
        "uv_index": NaN,
        "visibility": NaN,
        "wind_bearing": NaN,
        "wind_speed": NaN,
        "location": NaN
      },
      {
        "observed": "In the spring of 1973 when I was 8 years old, I was mushrooming with my mom, aunt, and several cousins in the woods near my grandparents home in rural Louisiana, Missouri.  We were in a deep hollow that was heavily wooded, when all of us started mentioning this horrible smell.  Since there seemed to be no source of the smell, we decided to head back up to the car because we knew about the \"Mo Mo\" sightings that had been occuring in and around Louisiana.  No one was at home at my grandparents so we all piled back into the car.  My mom had left down the window and within a few minutes we heard something let out a scream.  My mom said it sounded like a panther scream, but between the horrible smell and the scream we did not investigate, we left in a hurry! My grandma while picking blackberries in this area also encountered the strange smell and may have actually seen the creature out her back door that summer.  She had a lilac bush about 6 foot tall about 25 foot from her back door, one night she was looking out and saw what appeared to be two red glowing eyes peering back at her.  My aunt and two uncles on two seperate occasions encountered what may have been \"Mo Mo\".  Both sightings occured that summer in the evening hours.  Each said they seen two glowing red eyes, and as they drove closer they seen what appeared to be a large, about 7-8 foot tall, hairy creature standing on its hind legs staring at them.  Also, some neighbors of ours who lived a few miles from my grandparents had seen the creature in the garden in their backyard behind their house, it ran away when they came out.  But having just rained, the creature had left its footprints behind.  They had it plaster casted and I actually seen it, it was about 14-16 inches long.",
        "location_details": "Most of the occurences happened on property that is no longer owned by my grandparents.  I do not know the name of the gravel road, but it is easy to find.  All occurences happened on this gravel road that is off of 54 and circles around several miles to another exit onto Highway 54.  My grandparents home was off the gravel road down a small lane that went a couple a miles back.  At that time the lane was heavily wooded on both sides.  Now it is unaccesible, the land having been made into a cow pasture and the trees pretty much have been bulldozed off years ago.",
        "county": "Pike County",
        "state": "Missouri",
        "season": "Spring",
        "title": "Report 5059: Family hears strange screams off Highway 54",
        "latitude": 39.445,
        "longitude": -91.07,
        "date": "1973-04-04",
        "number": 5059.0,
        "classification": "Class B",
        "geohash": "9zp0rsszg0",
        "temperature_high": NaN,
        "temperature_mid": NaN,
        "temperature_low": NaN,
        "dew_point": NaN,
        "humidity": NaN,
        "cloud_cover": NaN,
        "moon_phase": NaN,
        "precip_intensity": NaN,
        "precip_probability": NaN,
        "precip_type": NaN,
        "pressure": NaN,
        "summary": NaN,
        "uv_index": NaN,
        "visibility": NaN,
        "wind_bearing": NaN,
        "wind_speed": NaN,
        "location": "POINT(-91.07 39.445)"
      },
      {
        "observed": "I had went for the evening to relax in the nearby harbor (Presque Isle) to have dinner and then drove up to the New Presque Isle Lighthouse and parked my car.  I walked thru a clearing of trees (east) from the lighthouse towards Lake Huron.  It was a full-moon, clear night with very little waves on the lake.  I had been at this location for around :30 minutes to about :45 minutes and had been wading out in the water to just cool off.  I was in shorts/t-shirt and flip-flops as it was summer.  After I decided that it was time to leave I started to go back towards my car and subsequently dry off.  As I was walking back thru the same clearing that I had come from earlier I could hear some motion in the trees to my left.  I remember also it was very still/quiet that night while on foot.  At different times I heard what sounded like large (or fairly large) twigs snapping on or near the ground and thought maybe it was a deer of some sort, probably not a bear I didn't think. Sometimes it would be one or two twigs/branches snapping, other times it was multiple snaps which would occur quite quickly as if perhaps (at the time) whatever it was had some good size weight to itself. I had the distinct impression (or sense) that I was being watched and it made me feel quite un-easy, I had a more sense of urgency at this point of just wanting to get to my car and leave.  Also at other times I heard what sounded like whole trees being moved or pushed somewhat out of the way, I was puzzled as it implied to me that something was off in the trees that had a fairly good size body mass.  As I continued on towards the end of the clearing, the sound would parallel (or stay) with me--it wasn't getting distant or going away from my vantage point of where I first starting hearing the commotion going on.  After I had gotten into my car I felt hugely relieved but couldn't still necessarily understand why.  I remember too, that I was constantly looking around \"over my shoulder\" very intently but figured it was more than likely a small animal and no big deal.  As I drove off (about maybe--?  50-100 yards) as I had already turned on the radio and was feeling pretty relaxed I noticed from off the left side of my car (from the headlights shining onto some of the trees and roadway) a large black, furry looking figure standing completely in the front of the tree line looking dead, straight at me with some powerful--menacing eyes.  (The eyes followed me as I went past).  It completely shocked me, I slammed on the brakes of my car and just sat in the middle of the road for around half a minute (or less) and was trying to figure out (rationalize/take in) what I had just seen.  It stood around I would say between 7'-8' feet tall and it's arms were unusually long.  More than anything, the face is what spooked me and I remember the most as it closely resembled that of a man--the nose was flat and it stood completely erect, was not slouched or bent over--exactly still.  The head looked like it was just perched onto some huge shoulders, the shoulders were massive going across and the upper torso was quite impressive.  I decided it would be best to just keep going as I had thought about of maybe turning the car around and shine my high beam lights into the tree line (to see if I could spot it again) but decided this probably would not be in my best interest.  I went on and headed back to Alpena where I had come from originally.  I was never so glad to see \"city lights\" again until I reached the north end of town while on U.S.-23.  I told no one what I had seen, actually for a long time.",
        "location_details": "Nearly at the end of the road, by the lighthouse is where I had my sighting.  Take US-23 north, to E. Grand Lake Rd and turn right.  Turn Right at (4-way intersection) and continue on E. Grand Lake Rd to Presque Isle Harbor.  About 1 mile north of the harbor is the New Presque Isle Lighthouse and the road ends in a U-turn or cul-de-sac as you are at the conclusion of this small peninsula.",
        "county": "Presque Isle County",
        "state": "Michigan",
        "season": "Summer",
        "title": "Report 33611: Air National Guardsman describes being ushered out of the woods culminating in a nighttime sighting from his car near the Presque Isle Lighthouse",
        "latitude": 45.351000000000006,
        "longitude": -83.4885,
        "date": "2003-07-15",
        "number": 33611.0,
        "classification": "Class A",
        "geohash": "f0h9upvs8z",
        "temperature_high": 75.56,
        "temperature_mid": 65.58,
        "temperature_low": 55.6,
        "dew_point": 61.03,
        "humidity": 0.81,
        "cloud_cover": 0.56,
        "moon_phase": 0.57,
        "precip_intensity": 0.0163,
        "precip_probability": 1.0,
        "precip_type": "rain",
        "pressure": 1009.83,
        "summary": "Rain until afternoon.",
        "uv_index": 5.0,
        "visibility": 8.29,
        "wind_bearing": 216.0,
        "wind_speed": 6.06,
        "location": "POINT(-83.4885 45.351000000000006)"
      },
      {
        "observed": "I am curious how far back you keep records. I lived between Wintersville and Bloomingdale, Ohio, when I was growing up. One night when I was about 15 or 16 (around 1980 or 1981), I heard a cry and a loud sound by my bedroom window. I was terrified, so I went up to the old part of the house and got my dad. When he got his flashlight and went out to see what was happening, he saw a huge hairy thing on two feet running away. The next morning when we got up, we saw that our down spout had been twisted around and then folded in half. Now ordinarily I wouldn't have thought anything more than a prank, but the down spout was made out of steel. We have woods all around us where our house is. It is in the Broadacre/Reeds Mill area, off of Old Highway 22. I was wanting to know about the history of that specific area and also if there is any place where I can go to hear the sounds of Bigfoot. I know at one point, a few years ago, I read stories of the area and also heard the sounds. Any help that you can give me would be appreciated. I have been haunted all these years.",
        "location_details": "From Wintersville going west on State Route 22 until you see the Reedsmill/Broadacre exit. Then you turn left. The next left is (edited) Drive. That is where my parents live.",
        "county": "Jefferson County",
        "state": "Ohio",
        "season": "Fall",
        "title": "Report 1507: Witness hears loud noise outside bedroom window, observes bipedal animal running away",
        "latitude": 40.36957,
        "longitude": -80.77387,
        "date": "1981-11-01",
        "number": 1507.0,
        "classification": "Class A",
        "geohash": "dpnt9vn3b3",
        "temperature_high": 67.06,
        "temperature_mid": 59.47,
        "temperature_low": 51.88,
        "dew_point": 39.49,
        "humidity": 0.61,
        "cloud_cover": 0.67,
        "moon_phase": 0.15,
        "precip_intensity": 0.0,
        "precip_probability": 0.0,
        "precip_type": NaN,
        "pressure": 1028.34,
        "summary": "Mostly cloudy throughout the day.",
        "uv_index": 3.0,
        "visibility": 8.07,
        "wind_bearing": 147.0,
        "wind_speed": 2.69,
        "location": "POINT(-80.77387 40.36957)"
      },
      {
        "observed": "This happened last year during bow season in michigan. I had walked a large loup on my friends property and came up to the swamp part of the small lake. I sat down then heard the most eerie scream i have ever heard and i am positive it was not a deer or bobcat. It was almost human like but i could feel the anger in the scream. i was probally 50 yards from the lake with heavy vegitation and trees between the lake and me and the scream came from inside the 50 yards. After the scream i stood up and heard what sounded like huge rocks being thrown into the lake. I got out of that area as quick as i could.",
        "location_details": "55 to f30 then turn on bamfield",
        "county": "Alcona County",
        "state": "Michigan",
        "season": "Fall",
        "title": "Report 21969: Possible vocalization heard at dusk by bowhunter near Glennie",
        "latitude": 44.56215,
        "longitude": -83.78585,
        "date": "2006-10-01",
        "number": 21969.0,
        "classification": "Class B",
        "geohash": "dpumt2m124",
        "temperature_high": 60.23,
        "temperature_mid": 48.805,
        "temperature_low": 37.38,
        "dew_point": 44.4,
        "humidity": 0.85,
        "cloud_cover": 0.56,
        "moon_phase": 0.3,
        "precip_intensity": 0.0,
        "precip_probability": 0.0,
        "precip_type": NaN,
        "pressure": NaN,
        "summary": "Mostly cloudy in the morning.",
        "uv_index": 3.0,
        "visibility": 9.28,
        "wind_bearing": 286.0,
        "wind_speed": 4.11,
        "location": "POINT(-83.78585 44.56215)"
      }
    ]
  },
  "nl_utterance": "Create a chart showing the moon phase for different regions.",
  "refer_fileds": [
    {
      "field": "moon_phase",
      "type": "quantitative"
    },
    {
      "field": [
        "state",
        "county"
      ],
      "type": "nominal"
    }
  ],
  "refer_others": [],
  "generated_chart_list": [
    {
      "mark": "arc",
      "encoding": {
        "theta": {
          "field": "moon_phase",
          "type": "quantitative",
          "aggregate": "sum"
        },
        "color": {
          "field": "state",
          "type": "nominal"
        }
      }
    },
    {
      "mark": "arc",
      "encoding": {
        "theta": {
          "field": "moon_phase",
          "type": "quantitative",
          "aggregate": "mean"
        },
        "color": {
          "field": "state",
          "type": "nominal"
        }
      }
    },
    {
      "mark": "arc",
      "encoding": {
        "theta": {
          "field": "moon_phase",
          "type": "quantitative",
          "aggregate": "sum"
        },
        "color": {
          "field": "county",
          "type": "nominal"
        }
      }
    },
    {
      "mark": "arc",
      "encoding": {
        "theta": {
          "field": "moon_phase",
          "type": "quantitative",
          "aggregate": "mean"
        },
        "color": {
          "field": "county",
          "type": "nominal"
        }
      }
    },
    {
      "mark": "bar",
      "encoding": {
        "x": {
          "field": "state",
          "type": "nominal"
        },
        "y": {
          "field": "moon_phase",
          "type": "quantitative",
          "aggregate": "sum"
        }
      }
    },
    {
      "mark": "bar",
      "encoding": {
        "x": {
          "field": "state",
          "type": "nominal"
        },
        "y": {
          "field": "moon_phase",
          "type": "quantitative",
          "aggregate": "mean"
        }
      }
    },
    {
      "mark": "bar",
      "encoding": {
        "x": {
          "field": "county",
          "type": "nominal"
        },
        "y": {
          "field": "moon_phase",
          "type": "quantitative",
          "aggregate": "sum"
        }
      }
    },
    {
      "mark": "bar",
      "encoding": {
        "x": {
          "field": "county",
          "type": "nominal"
        },
        "y": {
          "field": "moon_phase",
          "type": "quantitative",
          "aggregate": "mean"
        }
      }
    },
    {
      "mark": "point",
      "encoding": {
        "x": {
          "field": "moon_phase",
          "type": "quantitative"
        },
        "y": {
          "field": "state",
          "type": "nominal"
        }
      }
    },
    {
      "mark": "point",
      "encoding": {
        "x": {
          "field": "moon_phase",
          "type": "quantitative"
        },
        "y": {
          "field": "county",
          "type": "nominal"
        }
      }
    },
    {
      "mark": "point",
      "encoding": {
        "x": {
          "field": "state",
          "type": "nominal"
        },
        "y": {
          "field": "moon_phase",
          "type": "quantitative"
        }
      }
    },
    {
      "mark": "point",
      "encoding": {
        "x": {
          "field": "county",
          "type": "nominal"
        },
        "y": {
          "field": "moon_phase",
          "type": "quantitative"
        }
      }
    },
    {
      "mark": "boxplot",
      "encoding": {
        "y": {
          "field": "moon_phase",
          "type": "quantitative"
        },
        "x": {
          "field": "state",
          "type": "nominal"
        }
      }
    },
    {
      "mark": "boxplot",
      "encoding": {
        "y": {
          "field": "moon_phase",
          "type": "quantitative"
        },
        "x": {
          "field": "county",
          "type": "nominal"
        }
      }
    }
  ]
}